Revit 2024 API
ScheduleField.SetCombinedParameters Method
 Sets this field's combine parameter array if applicable
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void SetCombinedParameters(
	IList<TableCellCombinedParameterData> data
)
Visual Basic
Public Sub SetCombinedParameters ( _
	data As IList(Of TableCellCombinedParameterData) _
)
Visual C++
public:
void SetCombinedParameters(
	IList<TableCellCombinedParameterData^>^ data
)
Parameters
data
Type: System.Collections.Generic.IList<TableCellCombinedParameterData>
 data is array of TableCellCombinedParameterData to be set as combined parameters
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace